app/controllers/blog_posts_controller.rb

UPDATE "blog_posts" SET "updated_at" = $1 WHERE "blog_posts"."id" = $2  [["updated_at", "2024-04-11 18:24:34.451202"], ["id", 4]]
---
  def update
    if @blog_post.update(blog_post_params)