app/controllers/blog_posts_controller.rb

SELECT COUNT(*) FROM "blog_posts" WHERE (published_at <= '2024-04-12 12:19:10.014479')
---
  def index
    @blog_posts = BlogPost.published.sorted.paginate(page: params[:page], per_page: 10)

INSERT INTO "blog_posts" ("title", "created_at", "updated_at", "published_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Draft Blog Post"], ["created_at", "2024-04-12 12:29:46.991574"], ["updated_at", "2024-04-12 12:29:46.991574"], ["published_at", "2023-06-08 05:05:00"]]
---
  def create
    @blog_post = current_user.blog_posts.build(blog_post_params)
    if @blog_post.save

UPDATE "blog_posts" SET "title" = $1, "updated_at" = $2 WHERE "blog_posts"."id" = $3  [["title", "Hello"], ["updated_at", "2024-04-11 15:36:47.050777"], ["id", 2]]
---
  def update
    if @blog_post.user == current_user || current_user.admin?
      if @blog_post.update(blog_post_params)

SELECT "blog_posts".* FROM "blog_posts" WHERE (published_at <= '2024-04-12 18:30:12.304165') AND "blog_posts"."id" = $1 LIMIT $2  [["id", 194], ["LIMIT", 1]]
---
  def set_blog_post
    @blog_post = BlogPost.find(params[:id])